proxy_artillery.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
    #   name: Warm up
    # - duration: 120
    #   arrivalRate: 5
    #   rampTo: 50
    #   name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load
scenarios:
  - flow:
      - loop:
        - get:
            url: "/api/products/9788999"
        count: 50
      # - loop:
      #   - post:
      #       url: "/api/products/10000000"
      #       json:
      #         product_name: "Testing the produ"
      #         brand: "HAKAMENO"
      #         rating: 5.6
      #         price: 3456.32
      #         prime: false
      #         size: 8
      #         dimensions: null
      #         color: "yellow"
      #         information: "THis sais a stirng of randomf e ingormation and typsone that tart eyjust meant to repres sen athing that exist sn thre wlrls."
      #   count: 5